constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (-1 -1  -2)
    ( 1 -1  -2)
    ( 1  1  -2)
    (-1  1  -2)
    (-1 -1  2)
    ( 1 -1  2)
    ( 1  1  2)
    (-1  1  2)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (10 10 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    maxY
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
        );
    }

    minX
    {
        type symmetryPlane;
        faces
        (
            (0 4 7 3)
        );
    }

    maxX
    {
        type symmetryPlane;
        faces
        (
            (2 6 5 1)
        );
    }

    minY
    {
        type symmetryPlane;
        faces
        (
            (1 5 4 0)
        );
    }

    outlet
    {
        type        patch;
        faces
        (
            (0 3 2 1)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
