0.org/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0.922666";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
25373
(
(-1.2302e-05 -0.000320116 -0.0549666)
(-0.000226756 -2.89094e-05 -0.0549827)
(3.96607e-05 7.41012e-05 -0.0547985)
(7.01071e-06 0.000116949 -0.0545057)
(-4.51202e-05 -0.000200408 -0.0549829)
(0.000233054 0.000257918 -0.0546985)
(0.000293652 0.000425598 -0.0536087)
(0.00013752 0.000501214 -0.0515204)
...
)
;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           nonuniform List<vector> 
160
(
(-0.00032617 -1.64351e-05 -0.0549669)
(-4.51202e-05 -0.000200408 -0.0549829)
(6.1784e-05 6.73714e-05 -0.0548004)
(0.000123837 2.63024e-05 -0.0545142)
(-0.000226756 -2.89094e-05 -0.0549827)
(0.000233054 0.000257918 -0.0546985)
(0.000417243 0.000340528 -0.053619)
(0.000524434 0.000174122 -0.0515951)
...
)
;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 -0.0512);
    }
    tubeWall_region0
    {
        type            slip;
    }
    fluid_to_bedOfSpheres
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
