0.org/fluid/U_0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0.922666";
    object      U_0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
25373
(
(-1.23021e-05 -0.000320116 -0.0549666)
(-0.000226756 -2.89094e-05 -0.0549827)
(3.96593e-05 7.40987e-05 -0.0547985)
(7.01076e-06 0.000116944 -0.0545057)
(-4.51203e-05 -0.000200408 -0.0549829)
(0.000233051 0.000257917 -0.0546985)
(0.000293649 0.000425596 -0.0536087)
(0.00013752 0.000501213 -0.0515204)
...
)
;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           nonuniform List<vector> 
160
(
(-0.000326171 -1.64353e-05 -0.0549669)
(-4.51203e-05 -0.000200408 -0.0549829)
(6.17825e-05 6.737e-05 -0.0548004)
(0.000123832 2.63025e-05 -0.0545142)
(-0.000226756 -2.89094e-05 -0.0549827)
(0.000233051 0.000257917 -0.0546985)
(0.000417241 0.000340526 -0.053619)
(0.000524433 0.000174121 -0.0515951)
...
)
;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 -0.0512);
    }
    tubeWall_region0
    {
        type            slip;
    }
    fluid_to_bedOfSpheres
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
