0.org/bedOfSpheres/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.922666";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 400;

boundaryField
{
    bedOfSpheres_to_fluid
    {
        type            fixedValue;
        value           uniform 400;
        /*
       type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           400;
        neighbourFieldName T;
        kappa           solidThermo;
        kappaName       none;*/
    }
}


// ************************************************************************* //
