0.org/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.922666";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
25373
(
300
300
300.001
300.005
300
300.001
300.034
300.298
...
)
;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           nonuniform List<scalar> 
160
(
300
300
300.001
300.005
300
300.001
300.034
300.285
...
)
;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 300;
    }

    tubeWall_region0
    {
        type            slip;
    }

    fluid_to_bedOfSpheres
    {
       /*type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           400;
        neighbourFieldName T;
        kappa           fluidThermo;
        kappaName       none;*/
        type            fixedValue;
        value           uniform 400;
    }
}


// ************************************************************************* //
