0.org/fluid/p_rgh_0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.922666";
    object      p_rgh_0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
25373
(
-0.0575163
-0.0428095
-0.0138391
-0.0116126
-0.0427701
-0.0133679
-0.010086
-0.00672951
...
)
;

boundaryField
{
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    inlet
    {
        type            zeroGradient;
    }
    tubeWall_region0
    {
        type            slip;
    }
    fluid_to_bedOfSpheres
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
