0.org/fluid/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0.922666";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
75547
(
2.91597e-09
-9.35441e-11
-9.73416e-09
-3.06003e-07
4.21614e-09
2.69463e-09
-1.04927e-08
-3.89587e-07
...
)
;

boundaryField
{
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
3.13288e-07
3.93094e-07
1.95906e-06
1.89234e-06
3.93169e-07
1.89896e-06
1.88541e-06
1.80697e-06
...
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
-2.92299e-07
-3.69538e-07
-1.82711e-06
-1.7754e-06
-3.69605e-07
-1.77601e-06
-1.799e-06
-1.79344e-06
...
)
;
    }
    tubeWall_region0
    {
        type            calculated;
        value           nonuniform List<scalar> 
2240
(
0
0
5.35316e-26
8.51181e-26
-9.28599e-26
-6.97293e-26
-1.32707e-25
1.83331e-26
...
)
;
    }
    fluid_to_bedOfSpheres
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
