0.org/fluid/rho_0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.922666";
    object      rho_0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 830;

boundaryField
{
    outlet
    {
        type            calculated;
        value           uniform 830;
    }
    inlet
    {
        type            calculated;
        value           uniform 830;
    }
    tubeWall_region0
    {
        type            calculated;
        value           uniform 830;
    }
    fluid_to_bedOfSpheres
    {
        type            calculated;
        value           uniform 830;
    }
}


// ************************************************************************* //
