0.org/fluid/wallHeatFlux
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.922666";
    object      wallHeatFlux;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    tubeWall_region0
    {
        type            calculated;
        value           uniform 0;
    }
    fluid_to_bedOfSpheres
    {
        type            calculated;
        value           nonuniform List<scalar> 
2688
(
72655.3
82173.8
73100
82097.3
66842.6
66510.7
96086
97479.1
...
)
;
    }
}


// ************************************************************************* //
